---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.HasDoubleWall
source: html/7d9ce3dd-b2f5-68c5-df1f-9f64bfe92915.htm
---
# Autodesk.Revit.DB.FabricationPart.HasDoubleWall Property

True if the fabrication part is double walled.

## Syntax (C#)
```csharp
public bool HasDoubleWall { get; }
```